In [1]:
import pandas as pd

## 파일을 읽고 데이터 프레임 생성

In [3]:
df = pd.read_csv("state-population.csv")

In [4]:
df.head()

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0

### 첫번째 칼럼을 인덱스로 전환하기

In [6]:
df_si = df.set_index('state/region')

In [7]:
df_si.head()

                 ages  year  population
state/region
AL            under18  2012   1117489.0
AL              total  2012   4817528.0
AL            under18  2010   1130966.0
AL              total  2010   4785570.0
AL            under18  2011   1125763.0

### 인덱스를 다시 칼럼으로 전환하기

In [17]:
help(df.reset_index)

Help on method reset_index in module pandas.core.frame:

reset_index(level=None, drop=False, inplace=False, col_level=0, col_fill='') method of pandas.core.frame.DataFrame instance
    For DataFrame with multi-level index, return new DataFrame with
    labeling information in the columns under the index names, defaulting
    to 'level_0', 'level_1', etc. if any are None. For a standard index,
    the index name will be used (if set), otherwise a default 'index' or
    'level_0' (if 'index' is already taken) will be used.

    Parameters
    ----------
    level : int, str, tuple, or list, default None
        Only remove the given levels from the index. Removes all levels by
        default
    drop : boolean, default False
        Do not try to insert index into dataframe columns. This resets
        the index to the default integer index.
    inplace : boolean, default False
        Modify the DataFrame in place (do not create a new object)
    col_level : int or str, default 0
        If the columns have multiple levels, determines which level the
        labels are inserted into. By default it is inserted into the first
        level.
    col_fill : object, default ''
        If the columns have multiple levels, determines how the other
        levels are named. If None then the index name is repeated.

    Returns
    -------
    resetted : DataFrame

In [8]:
df_ri = df_si.reset_index()

In [10]:
df_ri.head()

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0

### 두개의 칼럼을 인덱스화 하기

In [18]:
df_si1 = df.set_index(['state/region','ages'])

In [19]:
df_si1.head()

                      year  population
state/region ages
AL           under18  2012   1117489.0
             total    2012   4817528.0
             under18  2010   1130966.0
             total    2010   4785570.0
             under18  2011   1125763.0

### 하나의 인덱스를 다시 칼럼으로 처리

In [20]:
df_ri1 = df_si1.reset_index(level='ages')

In [21]:
df_ri1.head()

                 ages  year  population
state/region
AL            under18  2012   1117489.0
AL              total  2012   4817528.0
AL            under18  2010   1130966.0
AL              total  2010   4785570.0
AL            under18  2011   1125763.0

### 리스트로 넘겨서 인덱스를 칼럼으로 변경하기

In [22]:
df_ri2 = df_si1.reset_index(level=['state/region','ages'])

In [23]:
df_ri2.head()

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0